In [1]:
import numpy as np
import pandas as pd

In [4]:
# dataframe frim 2D array

np.random.seed(101)
my_data = np.random.randint(0,101,(4,3))

In [6]:
my_data

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [8]:
my_index = ['CA','NY','AZ','TX']

In [10]:
my_columns = ['Jan','Feb','Mar']

In [16]:
df = pd.DataFrame(my_data,index = my_index,columns = my_columns)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [28]:

pwd  # python code location

'P:\\Projects\\data-science-with-python\\pandas Programs'

In [30]:
#P:\Data Files\datafiles

In [32]:
ls p:

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects\data-science-with-python\pandas Programs

03-12-2024  12:19 PM    <DIR>          .
02-12-2024  02:02 PM    <DIR>          ..
03-12-2024  12:03 PM    <DIR>          .ipynb_checkpoints
02-12-2024  09:05 PM             7,310 1.series_programs.ipynb
03-12-2024  12:19 PM             5,128 2.dataframes.ipynb
               2 File(s)         12,438 bytes
               3 Dir(s)  159,859,466,240 bytes free

In [36]:
ls "p:"

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects\data-science-with-python\pandas Programs

03-12-2024  12:21 PM    <DIR>          .
02-12-2024  02:02 PM    <DIR>          ..
03-12-2024  12:03 PM    <DIR>          .ipynb_checkpoints
02-12-2024  09:05 PM             7,310 1.series_programs.ipynb
03-12-2024  12:21 PM             6,227 2.dataframes.ipynb
               2 File(s)         13,537 bytes
               3 Dir(s)  159,859,466,240 bytes free

In [38]:
cd ..

P:\Projects\data-science-with-python

In [40]:
cd ..

P:\Projects

In [42]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects

01-12-2024  04:00 PM    <DIR>          .
01-12-2024  01:00 PM    <DIR>          .ipynb_checkpoints
02-12-2024  02:02 PM    <DIR>          data-science-with-python
24-11-2024  10:50 AM    <DIR>          Kafka_Project
23-11-2024  12:31 PM    <DIR>          Spark_Structured_streaming
               0 File(s)              0 bytes
               5 Dir(s)  159,859,466,240 bytes free

In [44]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects

01-12-2024  04:00 PM    <DIR>          .
01-12-2024  01:00 PM    <DIR>          .ipynb_checkpoints
02-12-2024  02:02 PM    <DIR>          data-science-with-python
24-11-2024  10:50 AM    <DIR>          Kafka_Project
23-11-2024  12:31 PM    <DIR>          Spark_Structured_streaming
               0 File(s)              0 bytes
               5 Dir(s)  159,859,466,240 bytes free

In [46]:
cd ..

P:\

In [48]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\

25-11-2024  12:48 PM    <DIR>          .ipynb_checkpoints
29-11-2024  12:34 PM    <DIR>          Advance sql queryinh
03-12-2024  12:17 PM    <DIR>          Data Files
01-12-2024  04:00 PM    <DIR>          Projects
01-12-2024  12:19 PM    <DIR>          Projects Data
01-10-2024  10:44 PM    <DIR>          python_programming
               0 File(s)              0 bytes
               6 Dir(s)  159,859,466,240 bytes free

In [16]:
df = pd.read_csv("P:\\Data Files\\datafiles\\fighters.csv")

In [17]:
df

       Name Country  Height (in cm)
0       Ryu   Japan             175
1       Ken     USA             175
2   Chun-Li   China             165
3     Guile     USA             182
4  E. Honda   Japan             185
5   Dhalsim   India             176
6    Blanka  Brazil             192
7   Zangief  Russia             214

In [ ]:
df

In [4]:
df.head()

       Name Country  Height (in cm)
0       Ryu   Japan             175
1       Ken     USA             175
2   Chun-Li   China             165
3     Guile     USA             182
4  E. Honda   Japan             185

In [5]:
df.tail()

       Name Country  Height (in cm)
3     Guile     USA             182
4  E. Honda   Japan             185
5   Dhalsim   India             176
6    Blanka  Brazil             192
7   Zangief  Russia             214

In [18]:
df['Name']

0         Ryu
1         Ken
2     Chun-Li
3       Guile
4    E. Honda
5     Dhalsim
6      Blanka
7     Zangief
Name: Name, dtype: object

In [20]:
df[df['Height (in cm)'] > 182]

       Name Country  Height (in cm)
4  E. Honda   Japan             185
6    Blanka  Brazil             192
7   Zangief  Russia             214

In [21]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects\data-science-with-python\pandas Programs

04-12-2024  02:00 PM    <DIR>          .
02-12-2024  02:02 PM    <DIR>          ..
03-12-2024  12:03 PM    <DIR>          .ipynb_checkpoints
02-12-2024  09:05 PM             7,310 1.series_programs.ipynb
04-12-2024  02:00 PM            20,513 2.dataframes.ipynb
               2 File(s)         27,823 bytes
               3 Dir(s)  159,789,076,480 bytes free

In [22]:
cd P:

P:\Projects\data-science-with-python\pandas Programs

In [23]:
cd ..\\..\\..

P:\

In [24]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\

25-11-2024  12:48 PM    <DIR>          .ipynb_checkpoints
29-11-2024  12:34 PM    <DIR>          Advance sql queryinh
03-12-2024  12:17 PM    <DIR>          Data Files
01-12-2024  04:00 PM    <DIR>          Projects
04-12-2024  02:57 PM    <DIR>          Projects Data
01-10-2024  10:44 PM    <DIR>          python_programming
               0 File(s)              0 bytes
               6 Dir(s)  159,789,076,480 bytes free

In [25]:
cd Projects Data

P:\Projects Data

In [26]:
ls

 Volume in drive P is Practice
 Volume Serial Number is F82D-6E56

 Directory of P:\Projects Data

04-12-2024  02:57 PM    <DIR>          .
26-11-2024  12:19 PM    <DIR>          Azure Structured Streaming
20-11-2024  11:14 AM    <DIR>          Azure Synapse Analytics
23-11-2024  08:53 PM    <DIR>          New folder
01-12-2024  12:19 PM    <DIR>          Pandas by Boris
04-12-2024  02:57 PM    <DIR>          python for data science and ML
20-11-2024  04:14 PM    <DIR>          Python Numpy and Pnadas
               0 File(s)              0 bytes
               7 Dir(s)  159,789,076,480 bytes free

In [27]:
cd python for data science and ML

P:\Projects Data\python for data science and ML

In [30]:
df = pd.read_csv("P:\Projects\data-science-with-python\datasets\\tips.csv")

In [31]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [33]:
df = df.set_index("Payment ID")

In [ ]:
#Conditional Filtering

In [34]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [42]:
df[ (df['total_bill']< 30) & (df['tip'] < 4)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat5032,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [43]:
# df[ (df['day' == 'Sun']) | (df['day' == 'Mon']) | (df['day' == 'Wed'])]

In [48]:
selected_days =  ['Sun','Mon','Wed']
df[df['day'].isin(selected_days)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sun4254,20.90,3.50,Female,Yes,Sun,Dinner,3,6.97,Heidi Atkinson,4422858423131187
Sun9987,30.46,2.00,Male,Yes,Sun,Dinner,5,6.09,David Barrett,4792882899700988
Sun430,18.15,3.50,Female,Yes,Sun,Dinner,3,6.05,Glenda Wiggins,578329325307
Sun1821,23.10,4.00,Male,Yes,Sun,Dinner,3,7.70,Richard Stevens,3560193117506187
Sun5104,15.69,1.50,Male,Yes,Sun,Dinner,2,7.84,Riley Barnes,180053549128800